yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			LPC1700.H
** Last modified Date:  2009-05-12
** Last Version:		V1.01
** Descriptions:		lpc1700寄存器地址定义
**
**--------------------------------------------------------------------------------------------------------
** Created by:			Liangbaoqiong
** Created date:		2009-05-12
** Version:				V1.00
** Descriptions:		
**--------------------------------------------------------------------------------------------------------
** Modified by:			Liangbaoqiong
** Modified date:		2009-05-12
** Version:				
** Descriptions:		对程序的风格以及注释略作调整，并检查代码。
*********************************************************************************************************/

#ifndef __IOLPC1700_H
#define __IOLPC1700_H

/*********************************************************************************************************
**  System control block 系统控制模块
*********************************************************************************************************/
#define MEMMAP                  (*(volatile unsigned long *)0x400FC040)
#define EXT_INT                  (*(volatile unsigned long *)0x400FC140)
#define EXT_MODE                 (*(volatile unsigned long *)0x400FC148)
#define EXT_POLAR                (*(volatile unsigned long *)0x400FC14C)
#define RSID                    (*(volatile unsigned long *)0x400FC180)
#define SCS                     (*(volatile unsigned long *)0x400FC1A0)
#define CLKSRCSEL               (*(volatile unsigned long *)0x400FC10C)
#define PLL0CON                 (*(volatile unsigned long *)0x400FC080)
#define PLL0CFG                 (*(volatile unsigned long *)0x400FC084)
#define PLL0STAT                (*(volatile unsigned long *)0x400FC088)
#define PLL0FEED                (*(volatile unsigned long *)0x400FC08C)
#define PLL1CON                 (*(volatile unsigned long *)0x400FC0A0)
#define PLL1CFG                 (*(volatile unsigned long *)0x400FC0A4)
#define PLL1STAT                (*(volatile unsigned long *)0x400FC0A8)
#define PLL1FEED                (*(volatile unsigned long *)0x400FC0AC)
#define CCLKCFG                 (*(volatile unsigned long *)0x400FC104)
#define USBCLKCFG               (*(volatile unsigned long *)0x400FC108)
#define IRCTRIM                 (*(volatile unsigned long *)0x400FC1A4)
#define PCLKSEL0                (*(volatile unsigned long *)0x400FC1A8)
#define PCLKSEL1                (*(volatile unsigned long *)0x400FC1AC)
#define P_CON                    (*(volatile unsigned long *)0x400FC0C0)
#define P_CONP                   (*(volatile unsigned long *)0x400FC0C4)
#define CLKOUTCFG               (*(volatile unsigned long *)0x400FC1C8)

/*********************************************************************************************************
**  Flash Accelerator Flash加速器
*********************************************************************************************************/
#define FLASHCFG                (*(volatile unsigned long *)0x400FC000)

/*********************************************************************************************************
**  NVIC嵌套向量中断控制器
*********************************************************************************************************/
//#define NVIC                    (*((volatile unsigned long *)0xE000E004))
#define STCTRL                  (*((volatile unsigned long *)0xE000E010))
#define STRELOAD                (*((volatile unsigned long *)0xE000E014))
#define STCURR                  (*((volatile unsigned long *)0xE000E018))
#define STCALIB                 (*((volatile unsigned long *)0xE000E01C))
#define SETENA0                 (*((volatile unsigned long *)0xE000E100))
#define SETENA1                 (*((volatile unsigned long *)0xE000E104))
#define CLRENA0                 (*((volatile unsigned long *)0xE000E180))
#define CLRENA1                 (*((volatile unsigned long *)0xE000E184))
#define SETPEND0                (*((volatile unsigned long *)0xE000E200))
#define SETPEND1                (*((volatile unsigned long *)0xE000E204))
#define CLRPEND0                (*((volatile unsigned long *)0xE000E280))
#define CLRPEND1                (*((volatile unsigned long *)0xE000E284))
#define ACTIVE0                 (*((volatile unsigned long *)0xE000E300))
#define ACTIVE1                 (*((volatile unsigned long *)0xE000E304))
#define IP0                     (*((volatile unsigned long *)0xE000E400))
#define IP1                     (*((volatile unsigned long *)0xE000E404))
#define IP2                     (*((volatile unsigned long *)0xE000E408))
#define IP3                     (*((volatile unsigned long *)0xE000E40C))
#define IP4                     (*((volatile unsigned long *)0xE000E410))
#define IP5                     (*((volatile unsigned long *)0xE000E414))
#define IP6                     (*((volatile unsigned long *)0xE000E418))
#define IP7                     (*((volatile unsigned long *)0xE000E41C))
#define IP8                     (*((volatile unsigned long *)0xE000E420))
#define IP9                     (*((volatile unsigned long *)0xE000E424))
#define IP10                    (*((volatile unsigned long *)0xE000E428))
#define IP11                    (*((volatile unsigned long *)0xE000E42C))
#define IP12                    (*((volatile unsigned long *)0xE000E430))
#define IP13                    (*((volatile unsigned long *)0xE000E434))
#define IP14                    (*((volatile unsigned long *)0xE000E438))
#define IP15                    (*((volatile unsigned long *)0xE000E43C))
#define CPUIDBR                 (*((volatile unsigned long *)0xE000ED00))
#define ICSR                    (*((volatile unsigned long *)0xE000ED04))
#define VTOR                    (*((volatile unsigned long *)0xE000ED08))
#define AITCR                   (*((volatile unsigned long *)0xE000ED0C))
#define SCR                     (*((volatile unsigned long *)0xE000ED10))
#define CC_R                     (*((volatile unsigned long *)0xE000ED14))
#define SHPR0                   (*((volatile unsigned long *)0xE000ED18))
#define SHPR1                   (*((volatile unsigned long *)0xE000ED1C))
#define SHPR2                   (*((volatile unsigned long *)0xE000ED20))
#define SHCSR                   (*((volatile unsigned long *)0xE000ED24))
#define CFSR                    (*((volatile unsigned long *)0xE000ED28))
#define HFSR                    (*((volatile unsigned long *)0xE000ED2C))
#define DFSR                    (*((volatile unsigned long *)0xE000ED30))
#define MMFAR                   (*((volatile unsigned long *)0xE000ED34))
#define BFAR                    (*((volatile unsigned long *)0xE000ED38))
#define STIR                    (*((volatile unsigned long *)0xE000EF00))

