yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  Pin connect block 引脚连接模块
*********************************************************************************************************/
#define PIN_SEL0                 (*((volatile unsigned long *)0x4002C000))
#define PIN_SEL1                 (*((volatile unsigned long *)0x4002C004))
#define PIN_SEL2                 (*((volatile unsigned long *)0x4002C008))
#define PIN_SEL3                 (*((volatile unsigned long *)0x4002C00C))
#define PIN_SEL4                 (*((volatile unsigned long *)0x4002C010))
#define PIN_SEL5                 (*((volatile unsigned long *)0x4002C014))
#define PIN_SEL6                 (*((volatile unsigned long *)0x4002C018))
#define PIN_SEL7                 (*((volatile unsigned long *)0x4002C01C))
#define PIN_SEL8                 (*((volatile unsigned long *)0x4002C020))
#define PIN_SEL9                 (*((volatile unsigned long *)0x4002C024))
#define PIN_SEL10                (*((volatile unsigned long *)0x4002C028))
#define PIN_MODE0                (*((volatile unsigned long *)0x4002C040))
#define PIN_MODE1                (*((volatile unsigned long *)0x4002C044))
#define PIN_MODE2                (*((volatile unsigned long *)0x4002C048))
#define PIN_MODE3                (*((volatile unsigned long *)0x4002C04C))
#define PIN_MODE4                (*((volatile unsigned long *)0x4002C050))
#define PIN_MODE5                (*((volatile unsigned long *)0x4002C054))
#define PIN_MODE6                (*((volatile unsigned long *)0x4002C058))
#define PIN_MODE7                (*((volatile unsigned long *)0x4002C05C))
#define PIN_MODE8                (*((volatile unsigned long *)0x4002C060))
#define PIN_MODE9                (*((volatile unsigned long *)0x4002C064))
#define PIN_MODE_OD0             (*((volatile unsigned long *)0x4002C068))
#define PIN_MODE_OD1             (*((volatile unsigned long *)0x4002C06C))
#define PIN_MODE_OD2             (*((volatile unsigned long *)0x4002C070))
#define PIN_MODE_OD3             (*((volatile unsigned long *)0x4002C074))
#define PIN_MODE_OD4             (*((volatile unsigned long *)0x4002C078))
#define I2CPADCFG               (*((volatile unsigned long *)0x4002C07C))

/*********************************************************************************************************
**  GPIO
*********************************************************************************************************/
#define FIO0DIR                 (*((volatile unsigned long *)0x2009c000))		//0		控制的引脚为输入,1	控制的引脚为输出
#define FIO0DIR0                (*((volatile unsigned long *)0x2009c000))
#define FIO0DIR1                (*((volatile unsigned long *)0x2009c001))
#define FIO0DIR2                (*((volatile unsigned long *)0x2009c002))
#define FIO0DIR3                (*((volatile unsigned long *)0x2009c003))
#define FIO0DIRL                (*((volatile unsigned long *)0x2009c000))
#define FIO0DIRU                (*((volatile unsigned long *)0x2009c002))

#define FIO1DIR                 (*((volatile unsigned long *)0x2009c020))
#define FIO1DIR0                (*((volatile unsigned long *)0x2009c020))
#define FIO1DIR1                (*((volatile unsigned long *)0x2009c021))
#define FIO1DIR2                (*((volatile unsigned long *)0x2009c022))
#define FIO1DIR3                (*((volatile unsigned long *)0x2009c023))
#define FIO1DIRL                (*((volatile unsigned long *)0x2009c020))
#define FIO1DIRU                (*((volatile unsigned long *)0x2009c022))
																	   
#define FIO2DIR                 (*((volatile unsigned long *)0x2009c040))
#define FIO2DIR0                (*((volatile unsigned long *)0x2009c040))
#define FIO2DIR1                (*((volatile unsigned long *)0x2009c041))
#define FIO2DIR2                (*((volatile unsigned long *)0x2009c042))
#define FIO2DIR3                (*((volatile unsigned long *)0x2009c043))
#define FIO2DIRL                (*((volatile unsigned long *)0x2009c040))
#define FIO2DIRU                (*((volatile unsigned long *)0x2009c042))

#define FIO3DIR                 (*((volatile unsigned long *)0x2009c060))
#define FIO3DIR0                (*((volatile unsigned long *)0x2009c060))
#define FIO3DIR1                (*((volatile unsigned long *)0x2009c061))
#define FIO3DIR2                (*((volatile unsigned long *)0x2009c062))
#define FIO3DIR3                (*((volatile unsigned long *)0x2009c063))
#define FIO3DIRL                (*((volatile unsigned long *)0x2009c060))
#define FIO3DIRU                (*((volatile unsigned long *)0x2009c062))

#define FIO4DIR                 (*((volatile unsigned long *)0x2009c080))
#define FIO4DIR0                (*((volatile unsigned long *)0x2009c080))
#define FIO4DIR1                (*((volatile unsigned long *)0x2009c081))
#define FIO4DIR2                (*((volatile unsigned long *)0x2009c082))
#define FIO4DIR3                (*((volatile unsigned long *)0x2009c083))
#define FIO4DIRL                (*((volatile unsigned long *)0x2009c080))
#define FIO4DIRU                (*((volatile unsigned long *)0x2009c082))
///////////////////////////////////////////////////////////////////////////////////////////////////////
#define FIO0MASK                (*(volatile unsigned long *)0x2009c010)		//0		对应引脚正常,	1	对应的引脚不能够通过FIOPIN,FIOSET,FIOCLR访问
#define FIO0MASK0               (*(volatile unsigned long *)0x2009c010)
#define FIO0MASK1               (*(volatile unsigned long *)0x2009c011)
#define FIO0MASK2               (*(volatile unsigned long *)0x2009c012)
#define FIO0MASK3               (*(volatile unsigned long *)0x2009c013)
#define FIO0MASKL               (*(volatile unsigned long *)0x2009c010)
#define FIO0MASKU               (*(volatile unsigned long *)0x2009c012)

#define FIO1MASK                (*(volatile unsigned long *)0x2009c030)
#define FIO1MASK0               (*(volatile unsigned long *)0x2009c030)
#define FIO1MASK1               (*(volatile unsigned long *)0x2009c031)
#define FIO1MASK2               (*(volatile unsigned long *)0x2009c032)
#define FIO1MASK3               (*(volatile unsigned long *)0x2009c033)
#define FIO1MASKL               (*(volatile unsigned long *)0x2009c030)
#define FIO1MASKU               (*(volatile unsigned long *)0x2009c032)

#define FIO2MASK                (*(volatile unsigned long *)0x2009c050)
#define FIO2MASK0               (*(volatile unsigned long *)0x2009c050)
#define FIO2MASK1               (*(volatile unsigned long *)0x2009c051)
#define FIO2MASK2               (*(volatile unsigned long *)0x2009c052)
#define FIO2MASK3               (*(volatile unsigned long *)0x2009c053)
#define FIO2MASKL               (*(volatile unsigned long *)0x2009c050)
#define FIO2MASKU               (*(volatile unsigned long *)0x2009c052)

#define FIO3MASK                (*(volatile unsigned long *)0x2009c070)
#define FIO3MASK0               (*(volatile unsigned long *)0x2009c070)
#define FIO3MASK1               (*(volatile unsigned long *)0x2009c071)
#define FIO3MASK2               (*(volatile unsigned long *)0x2009c072)
#define FIO3MASK3               (*(volatile unsigned long *)0x2009c073)
#define FIO3MASKL               (*(volatile unsigned long *)0x2009c070)
#define FIO3MASKU               (*(volatile unsigned long *)0x2009c072)

#define FIO4MASK                (*(volatile unsigned long *)0x2009c090)
#define FIO4MASK0               (*(volatile unsigned long *)0x2009c090)
#define FIO4MASK1               (*(volatile unsigned long *)0x2009c091)
#define FIO4MASK2               (*(volatile unsigned long *)0x2009c092)
#define FIO4MASK3               (*(volatile unsigned long *)0x2009c093)
#define FIO4MASKL               (*(volatile unsigned long *)0x2009c090)
#define FIO4MASKU               (*(volatile unsigned long *)0x2009c092)
///////////////////////////////////////////////////////////////////////////////////////////////////////
																			//不关心引脚配置为输入或输出,如果要使输出有些必须将相应引脚设置为输出模式
#define FIO0PIN                 (*(volatile unsigned long *)0x2009c014)		//0		控制的引脚输出被设置为低,1	控制的引脚输出被设置为高
#define FIO0PIN0                (*(volatile unsigned long *)0x2009c014)
#define FIO0PIN1                (*(volatile unsigned long *)0x2009c015)
#define FIO0PIN2                (*(volatile unsigned long *)0x2009c016)
#define FIO0PIN3                (*(volatile unsigned long *)0x2009c017)
#define FIO0PINL                (*(volatile unsigned long *)0x2009c014)
#define FIO0PINU                (*(volatile unsigned long *)0x2009c016)

#define FIO1PIN                 (*(volatile unsigned long *)0x2009c034)
#define FIO1PIN0                (*(volatile unsigned long *)0x2009c034)
#define FIO1PIN1                (*(volatile unsigned long *)0x2009c035)
#define FIO1PIN2                (*(volatile unsigned long *)0x2009c036)
#define FIO1PIN3                (*(volatile unsigned long *)0x2009c037)
#define FIO1PINL                (*(volatile unsigned long *)0x2009c034)
#define FIO1PINU                (*(volatile unsigned long *)0x2009c036)

