yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
#define FIO2PIN                 (*(volatile unsigned long *)0x2009c054)
#define FIO2PIN0                (*(volatile unsigned long *)0x2009c054)
#define FIO2PIN1                (*(volatile unsigned long *)0x2009c055)
#define FIO2PIN2                (*(volatile unsigned long *)0x2009c056)
#define FIO2PIN3                (*(volatile unsigned long *)0x2009c057)
#define FIO2PINL                (*(volatile unsigned long *)0x2009c054)
#define FIO2PINU                (*(volatile unsigned long *)0x2009c056)

#define FIO3PIN                 (*(volatile unsigned long *)0x2009c074)
#define FIO3PIN0                (*(volatile unsigned long *)0x2009c074)
#define FIO3PIN1                (*(volatile unsigned long *)0x2009c075)
#define FIO3PIN2                (*(volatile unsigned long *)0x2009c076)
#define FIO3PIN3                (*(volatile unsigned long *)0x2009c077)
#define FIO3PINL                (*(volatile unsigned long *)0x2009c074)
#define FIO3PINU                (*(volatile unsigned long *)0x2009c076)

#define FIO4PIN                 (*(volatile unsigned long *)0x2009c094)
#define FIO4PIN0                (*(volatile unsigned long *)0x2009c094)
#define FIO4PIN1                (*(volatile unsigned long *)0x2009c095)
#define FIO4PIN2                (*(volatile unsigned long *)0x2009c096)
#define FIO4PIN3                (*(volatile unsigned long *)0x2009c097)
#define FIO4PINL                (*(volatile unsigned long *)0x2009c094)
#define FIO4PINU                (*(volatile unsigned long *)0x2009c096)
///////////////////////////////////////////////////////////////////////////////////////////////////////
#define FIO0SET                 (*(volatile unsigned long *)0x2009c018)		//0		控制的引脚输出不改变,1	控制的引脚输出被设置为高
#define FIO0SET0                (*(volatile unsigned long *)0x2009c018)
#define FIO0SET1                (*(volatile unsigned long *)0x2009c019)
#define FIO0SET2                (*(volatile unsigned long *)0x2009c01A)
#define FIO0SET3                (*(volatile unsigned long *)0x2009c01B)
#define FIO0SETL                (*(volatile unsigned long *)0x2009c018)
#define FIO0SETU                (*(volatile unsigned long *)0x2009c01A)

#define FIO1SET                 (*(volatile unsigned long *)0x2009c038)
#define FIO1SET0                (*(volatile unsigned long *)0x2009c038)
#define FIO1SET1                (*(volatile unsigned long *)0x2009c039)
#define FIO1SET2                (*(volatile unsigned long *)0x2009c03A)
#define FIO1SET3                (*(volatile unsigned long *)0x2009c03B)
#define FIO1SETL                (*(volatile unsigned long *)0x2009c038)
#define FIO1SETU                (*(volatile unsigned long *)0x2009c03A)

#define FIO2SET                 (*(volatile unsigned long *)0x2009c058)
#define FIO2SET0                (*(volatile unsigned long *)0x2009c058)
#define FIO2SET1                (*(volatile unsigned long *)0x2009c059)
#define FIO2SET2                (*(volatile unsigned long *)0x2009c05A)
#define FIO2SET3                (*(volatile unsigned long *)0x2009c05B)
#define FIO2SETL                (*(volatile unsigned long *)0x2009c058)
#define FIO2SETU                (*(volatile unsigned long *)0x2009c05A)

#define FIO3SET                 (*(volatile unsigned long *)0x2009c078)
#define FIO3SET0                (*(volatile unsigned long *)0x2009c078)
#define FIO3SET1                (*(volatile unsigned long *)0x2009c079)
#define FIO3SET2                (*(volatile unsigned long *)0x2009c07A)
#define FIO3SET3                (*(volatile unsigned long *)0x2009c07B)
#define FIO3SETL                (*(volatile unsigned long *)0x2009c078)
#define FIO3SETU                (*(volatile unsigned long *)0x2009c07A)
#define FIO4SET                 (*(volatile unsigned long *)0x2009c098)
#define FIO4SET0                (*(volatile unsigned long *)0x2009c098)
#define FIO4SET1                (*(volatile unsigned long *)0x2009c099)
#define FIO4SET2                (*(volatile unsigned long *)0x2009c09A)
#define FIO4SET3                (*(volatile unsigned long *)0x2009c09B)
#define FIO4SETL                (*(volatile unsigned long *)0x2009c098)
#define FIO4SETU                (*(volatile unsigned long *)0x2009c09A)
///////////////////////////////////////////////////////////////////////////////////////////////////////
#define FIO0CLR                 (*(volatile unsigned long *)0x2009c01c)		//0		控制的引脚输出不改变,1	控制的引脚输出被设置为低
#define FIO0CLR0                (*(volatile unsigned long *)0x2009c01c)
#define FIO0CLR1                (*(volatile unsigned long *)0x2009c01D)
#define FIO0CLR2                (*(volatile unsigned long *)0x2009c01E)
#define FIO0CLR3                (*(volatile unsigned long *)0x2009c01F)
#define FIO0CLRL                (*(volatile unsigned long *)0x2009c01c)
#define FIO0CLRU                (*(volatile unsigned long *)0x2009c01E)

#define FIO1CLR                 (*(volatile unsigned long *)0x2009c03c)
#define FIO1CLR0                (*(volatile unsigned long *)0x2009c03c)
#define FIO1CLR1                (*(volatile unsigned long *)0x2009c03D)
#define FIO1CLR2                (*(volatile unsigned long *)0x2009c03E)
#define FIO1CLR3                (*(volatile unsigned long *)0x2009c03F)
#define FIO1CLRL                (*(volatile unsigned long *)0x2009c03c)
#define FIO1CLRU                (*(volatile unsigned long *)0x2009c03E)

#define FIO2CLR                 (*(volatile unsigned long *)0x2009c05c)
#define FIO2CLR0                (*(volatile unsigned long *)0x2009c05c)
#define FIO2CLR1                (*(volatile unsigned long *)0x2009c05D)
#define FIO2CLR2                (*(volatile unsigned long *)0x2009c05E)
#define FIO2CLR3                (*(volatile unsigned long *)0x2009c05F)
#define FIO2CLRL                (*(volatile unsigned long *)0x2009c05c)
#define FIO2CLRU                (*(volatile unsigned long *)0x2009c05E)

#define FIO3CLR                 (*(volatile unsigned long *)0x2009c07c)
#define FIO3CLR0                (*(volatile unsigned long *)0x2009c07c)
#define FIO3CLR1                (*(volatile unsigned long *)0x2009c07D)
#define FIO3CLR2                (*(volatile unsigned long *)0x2009c07E)
#define FIO3CLR3                (*(volatile unsigned long *)0x2009c07F)
#define FIO3CLRL                (*(volatile unsigned long *)0x2009c07c)
#define FIO3CLRU                (*(volatile unsigned long *)0x2009c07E)

#define FIO4CLR                 (*(volatile unsigned long *)0x2009c09c)
#define FIO4CLR0                (*(volatile unsigned long *)0x2009c09c)
#define FIO4CLR1                (*(volatile unsigned long *)0x2009c09D)
#define FIO4CLR2                (*(volatile unsigned long *)0x2009c09E)
#define FIO4CLR3                (*(volatile unsigned long *)0x2009c09F)
#define FIO4CLRL                (*(volatile unsigned long *)0x2009c09c)
#define FIO4CLRU                (*(volatile unsigned long *)0x2009c09E)
///////////////////////////////////////////////////////////////////////////////////////////////////////
#define IO0IntEnR               (*(volatile unsigned long *)0x40028090)		//上升沿的GPIO中断使能   0 上升沿中断禁能,	1  上升沿中断使能
#define IO2IntEnR               (*(volatile unsigned long *)0x400280B0)

#define IO0IntEnF               (*(volatile unsigned long *)0x40028094)		//下降沿的GPIO中断使能   0 下降沿中断禁能,	1  下降沿中断使能
#define IO2IntEnF               (*(volatile unsigned long *)0x400280B4)

#define IO0IntStatR             (*(volatile unsigned long *)0x40028084)		//上升沿的GPIO中断标志   0  对应引脚上没有上升沿中断,1  对应引脚上出现上升沿中断
#define IO2IntStatR             (*(volatile unsigned long *)0x400280A4)

#define IO0IntStatF             (*(volatile unsigned long *)0x40028088)		//下降沿的GPIO中断标志   0  对应引脚上没有下降沿中断,1  对应引脚上出现下降沿中断
#define IO2IntStatF             (*(volatile unsigned long *)0x400280A8)

