yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
#define IO0IntClr               (*(volatile unsigned long *)0x4002808C)		//GPIO中断标志清零
#define IO2IntClr               (*(volatile unsigned long *)0x400280AC)

#define IOIntStatus             (*(volatile unsigned long *)0x40028080)		//GPIO整体中断状态
																			//bit0   0  P0上没有挂起的中断		1   P0上至少有一个挂起的中断
																			//bit1	 保留
																			//bit2	 0  P2上没有挂起的中断		1   P2上至少有一个挂起的中断
																			//bit31~3  保留

/*********************************************************************************************************
**  ETHERNET
*********************************************************************************************************/
#define MAC_MAC1                (*(volatile unsigned long *)0x50000000)
#define MAC_MAC2                (*(volatile unsigned long *)0x50000004)
#define MAC_IPGT                (*(volatile unsigned long *)0x50000008)
#define MAC_IPGR                (*(volatile unsigned long *)0x5000000C)
#define MAC_CLRT                (*(volatile unsigned long *)0x50000010)
#define MAC_MAXF                (*(volatile unsigned long *)0x50000014)
#define MAC_SUPP                (*(volatile unsigned long *)0x50000018)
#define MAC_TEST                (*(volatile unsigned long *)0x5000001C)
#define MAC_MCFG                (*(volatile unsigned long *)0x50000020)
#define MAC_MCMD                (*(volatile unsigned long *)0x50000024)
#define MAC_MADR                (*(volatile unsigned long *)0x50000028)
#define MAC_MWTD                (*(volatile unsigned long *)0x5000002C)
#define MAC_MRDD                (*(volatile unsigned long *)0x50000030)
#define MAC_MIND                (*(volatile unsigned long *)0x50000034)
#define MAC_SA0                 (*(volatile unsigned long *)0x50000040)
#define MAC_SA1                 (*(volatile unsigned long *)0x50000044)
#define MAC_SA2                 (*(volatile unsigned long *)0x50000048)
#define MAC_COMMAND             (*(volatile unsigned long *)0x50000100)
#define MAC_Status              (*(volatile unsigned long *)0x50000104)
#define MAC_RXDESCRIPTOR        (*(volatile unsigned long *)0x50000108)
#define MAC_RXSTATUS            (*(volatile unsigned long *)0x5000010C)
#define MAC_RXDESCRIPTORNUM     (*(volatile unsigned long *)0x50000110)
#define MAC_RXPRODUCEINDEX      (*(volatile unsigned long *)0x50000114)
#define MAC_RXCONSUMEINDEX      (*(volatile unsigned long *)0x50000118)
#define MAC_TXDESCRIPTOR        (*(volatile unsigned long *)0x5000011C)
#define MAC_TXSTATUS            (*(volatile unsigned long *)0x50000120)
#define MAC_TXDESCRIPTORNUM     (*(volatile unsigned long *)0x50000124)
#define MAC_TXPRODUCEINDEX      (*(volatile unsigned long *)0x50000128)
#define MAC_TXCONSUMEINDEX      (*(volatile unsigned long *)0x5000012C)
#define MAC_TSV0                (*(volatile unsigned long *)0x50000158)
#define MAC_TSV1                (*(volatile unsigned long *)0x5000015C)
#define MAC_RSV                 (*(volatile unsigned long *)0x50000160)
#define MAC_FlowControlCounter  (*(volatile unsigned long *)0x50000170)
#define MAC_FlowControlStatus   (*(volatile unsigned long *)0x50000174)
#define MAC_RXFILTERCTRL        (*(volatile unsigned long *)0x50000200)
#define MAC_RxFilterWoLStatus   (*(volatile unsigned long *)0x50000204)
#define MAC_RxFilterWoLClear    (*(volatile unsigned long *)0x50000208)
#define MAC_HashFilterL         (*(volatile unsigned long *)0x50000210)
#define MAC_HashFilterH         (*(volatile unsigned long *)0x50000214)
#define MAC_INTSTATUS           (*(volatile unsigned long *)0x50000FE0)
#define MAC_INTENABLE           (*(volatile unsigned long *)0x50000FE4)
#define MAC_INTCLEAR            (*(volatile unsigned long *)0x50000FE8)
#define MAC_IntSet              (*(volatile unsigned long *)0x50000FEC)
#define MAC_PowerDown           (*(volatile unsigned long *)0x50000FF4)

/*********************************************************************************************************
**  USB
*********************************************************************************************************/
#define USBClkCtrl              (*(volatile unsigned long *)0x5000CFF4)
#define USBClkSt                (*(volatile unsigned long *)0x5000CFF8)
#define USBIntSt                (*(volatile unsigned long *)0x400FC1C0)
#define USBDevIntSt             (*(volatile unsigned long *)0x5000C200)
#define USBDevIntEn             (*(volatile unsigned long *)0x5000C204)
#define USBDevIntClr            (*(volatile unsigned long *)0x5000C208)
#define USBDevIntSet            (*(volatile unsigned long *)0x5000C20C)
#define USBDevIntPri            (*(volatile unsigned long *)0x5000C22C)
#define USBEpIntSt              (*(volatile unsigned long *)0x5000C230)
#define USBEpIntEn              (*(volatile unsigned long *)0x5000C234)
#define USBEpIntClr             (*(volatile unsigned long *)0x5000C238)
#define USBEpIntSet             (*(volatile unsigned long *)0x5000C23C)
#define USBEpIntPri             (*(volatile unsigned long *)0x5000C240)
#define USBReEp                 (*(volatile unsigned long *)0x5000C244)
#define USBEpInd                (*(volatile unsigned long *)0x5000C248)
#define USBMaxPSize             (*(volatile unsigned long *)0x5000C24C)
#define USBRxData               (*(volatile unsigned long *)0x5000C218)
#define USBRxPLen               (*(volatile unsigned long *)0x5000C220)
#define USBTxData               (*(volatile unsigned long *)0x5000C21C)
#define USBTxPLen               (*(volatile unsigned long *)0x5000C224)
#define USBCtrl                 (*(volatile unsigned long *)0x5000C228)
#define USBCmdCode              (*(volatile unsigned long *)0x5000C210)
#define USBCmdData              (*(volatile unsigned long *)0x5000C214)
#define USBDMARSt               (*(volatile unsigned long *)0x5000C250)
#define USBDMARClr              (*(volatile unsigned long *)0x5000C254)
#define USBDMARSet              (*(volatile unsigned long *)0x5000C258)
#define USBUDCAH                (*(volatile unsigned long *)0x5000C280)
#define USBEpDMASt              (*(volatile unsigned long *)0x5000C284)
#define USBEpDMAEn              (*(volatile unsigned long *)0x5000C288)
#define USBEpDMADis             (*(volatile unsigned long *)0x5000C28C)
#define USBDMAIntSt             (*(volatile unsigned long *)0x5000C290)
#define USBDMAIntEn             (*(volatile unsigned long *)0x5000C294)
#define USBEoTIntSt             (*(volatile unsigned long *)0x5000C2A0)
#define USBEoTIntClr            (*(volatile unsigned long *)0x5000C2A4)
#define USBEoTIntSet            (*(volatile unsigned long *)0x5000C2A8)
#define USBNDDRIntSt            (*(volatile unsigned long *)0x5000C2AC)
#define USBNDDRIntClr           (*(volatile unsigned long *)0x5000C2B0)
#define USBNDDRIntSet           (*(volatile unsigned long *)0x5000C2B4)
#define USBSysErrIntSt          (*(volatile unsigned long *)0x5000C2B8)
#define USBSysErrIntClr         (*(volatile unsigned long *)0x5000C2BC)
#define USBSysErrIntSet         (*(volatile unsigned long *)0x5000C2C0)

