yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  USB HOST (OHCI) CONTROLLER
*********************************************************************************************************/
#define HcRevision              (*(volatile unsigned long *)0x5000C000)
#define HcControl               (*(volatile unsigned long *)0x5000C004)
#define HcCommandStatus         (*(volatile unsigned long *)0x5000C008)
#define HcInterruptStatus       (*(volatile unsigned long *)0x5000C00C)
#define HcInterruptEnable       (*(volatile unsigned long *)0x5000C010)
#define HcInterruptDisable      (*(volatile unsigned long *)0x5000C014)
#define HcHCCA                  (*(volatile unsigned long *)0x5000C018)
#define HcPeriodCurrentED       (*(volatile unsigned long *)0x5000C01C)
#define HcControlHeadED         (*(volatile unsigned long *)0x5000C020)
#define HcControlCurrentED      (*(volatile unsigned long *)0x5000C024)
#define HcBulkHeadED            (*(volatile unsigned long *)0x5000C028)
#define HcBulkCurrentED         (*(volatile unsigned long *)0x5000C02C)
#define HcDoneHead              (*(volatile unsigned long *)0x5000C030)
#define HcFmInterval            (*(volatile unsigned long *)0x5000C034)
#define HcFmRemaining           (*(volatile unsigned long *)0x5000C038)
#define HcFmNumber              (*(volatile unsigned long *)0x5000C03C)
#define HcPeriodicStart         (*(volatile unsigned long *)0x5000C040)
#define HcLSThreshold           (*(volatile unsigned long *)0x5000C044)
#define HcRhDescriptorA         (*(volatile unsigned long *)0x5000C048)
#define HcRhDescriptorB         (*(volatile unsigned long *)0x5000C04C)
#define HcRhStatus              (*(volatile unsigned long *)0x5000C050)
#define HcRhPortStatus1         (*(volatile unsigned long *)0x5000C054)
#define HcRhPortStatus2         (*(volatile unsigned long *)0x5000C058)
#define Module_ID               (*(volatile unsigned long *)0x5000C0FC)

/*********************************************************************************************************
**  USB OTG Controller
*********************************************************************************************************/
#define OTGIntSt                (*(volatile unsigned long *)0x5000C100)
#define OTGIntEn                (*(volatile unsigned long *)0x5000C104)
#define OTGIntSet               (*(volatile unsigned long *)0x5000C108)
#define OTGIntClr               (*(volatile unsigned long *)0x5000C10C)
#define OTGStCtrl               (*(volatile unsigned long *)0x5000C110)
#define OTGTmr                  (*(volatile unsigned long *)0x5000C114)
#define I2C_RX                  (*(volatile unsigned long *)0x5000C300)
#define I2C_TX                  I2C_RX
#define I2C_STS                 (*(volatile unsigned long *)0x5000C304)
#define I2C_CTL                 (*(volatile unsigned long *)0x5000C308)
#define I2C_CLKHI               (*(volatile unsigned long *)0x5000C30C)
#define I2C_CLKLO               (*(volatile unsigned long *)0x5000C310)
#define OTGClkCtrl              USBClkCtrl
#define OTGClkSt                USBClkSt

/*********************************************************************************************************
**  UART0
*********************************************************************************************************/
#define U0RBRTHR                (*(volatile unsigned long *)0x4000C000) /* U0DLL, U0RBR and U0THR       */
																		/* share the same address       */
#define U0DLL                   (*(volatile unsigned long *)0x4000C000) //除数锁存LSB                               
#define U0RBR                   (*(volatile unsigned long *)0x4000C000)	//接收器缓冲
#define U0THR                   (*(volatile unsigned long *)0x4000C000)	//发送器缓冲

#define U0IER                   (*(volatile unsigned long *)0x4000C004) /* U0DLM and U0IER              */ //中断使能
																		/* share the same address       */
#define U0DLM                   (*(volatile unsigned long *)0x4000C004) //除数锁存MSB                                 

#define U0FCR                   (*(volatile unsigned long *)0x4000C008) /* U0FCR and U0IIR              */  //FIFO控制
																		/* share the same address       */
#define U0IIR                   (*(volatile unsigned long *)0x4000C008) //中断ID                                  

#define U0LCR                   (*(volatile unsigned long *)0x4000C00C)	//线控制
#define U0LSR                   (*(volatile unsigned long *)0x4000C014)	//线状态
#define U0SCR                   (*(volatile unsigned long *)0x4000C01C)	//高速缓存
#define U0ACR                   (*(volatile unsigned long *)0x4000C020)	//自动波特率控制
#define U0FDR                   (*(volatile unsigned long *)0x4000C028)	//小数分频器
#define U0TER                   (*(volatile unsigned long *)0x4000C030)	//发送使能
#define U0FIFOLVL               (*(volatile unsigned long *)0x4000C058)	//FIFO状态寄存器

/*********************************************************************************************************
**  UART1
*********************************************************************************************************/
#define U1RBRTHR                (*(volatile unsigned long *)0x40010000) /* U1DLL, U1RBR and U1THR       */
																		/* share the same address       */
#define U1DLL                   (*(volatile unsigned long *)0x40010000)                               
#define U1RBR                   (*(volatile unsigned long *)0x40010000)
#define U1THR                   (*(volatile unsigned long *)0x40010000)

#define U1IER                   (*(volatile unsigned long *)0x40010004) /* U1DLM and U1IER              */
																		/* share the same address       */
#define U1DLM                   (*(volatile unsigned long *)0x40010004)                                   


#define U1FCR                   (*(volatile unsigned long *)0x40010008) /* U1FCR and U1IIR              */
																		/* share the same address       */
#define U1IIR                   (*(volatile unsigned long *)0x40010008)                                   

#define U1LCR                   (*(volatile unsigned long *)0x4001000C)
#define U1MCR                   (*(volatile unsigned long *)0x40010010)
#define U1LSR                   (*(volatile unsigned long *)0x40010014)
#define U1MSR                   (*(volatile unsigned long *)0x40010018)
#define U1SCR                   (*(volatile unsigned long *)0x4001001C)
#define U1ACR                   (*(volatile unsigned long *)0x40010020)
#define U1FDR                   (*(volatile unsigned long *)0x40010028)
#define U1TER                   (*(volatile unsigned long *)0x40010030)
#define U1RS485CTRL             (*(volatile unsigned long *)0x4001004C)
#define U1ADRMATCH              (*(volatile unsigned long *)0x40010050)
#define U1RS485DLY              (*(volatile unsigned long *)0x40010054)
#define U1FIFOLVL               (*(volatile unsigned long *)0x40010058)

