yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  UART2
*********************************************************************************************************/
#define U2RBRTHR                (*(volatile unsigned long *)0x40098000) /* U2DLL, U2RBR and U2THR       */
																		/* share the same address       */
#define U2DLL                   (*(volatile unsigned long *)0x40098000)                               
#define U2RBR                   (*(volatile unsigned long *)0x40098000)
#define U2THR                   (*(volatile unsigned long *)0x40098000)

#define U2IER                   (*(volatile unsigned long *)0x40098004) /* U2DLM and U2IER              */
																		/* share the same address       */
#define U2DLM                   (*(volatile unsigned long *)0x40098004)                                  
																	
#define U2FCR                   (*(volatile unsigned long *)0x40098008) /* U2FCR and U2IIR              */
																		/* share the same address       */
#define U2IIR                   (*(volatile unsigned long *)0x40098008)                                   

#define U2LCR                   (*(volatile unsigned long *)0x4009800C)
#define U2LSR                   (*(volatile unsigned long *)0x40098014)
#define U2SCR                   (*(volatile unsigned long *)0x4009801C)
#define U2ACR                   (*(volatile unsigned long *)0x40098020)
#define U2FDR                   (*(volatile unsigned long *)0x40098028)
#define U2TER                   (*(volatile unsigned long *)0x40098030)
#define U2FIFOLVL               (*(volatile unsigned long *)0x40098058)

/*********************************************************************************************************
**  UART3
*********************************************************************************************************/
#define U3RBRTHR                (*(volatile unsigned long *)0x4009C000) /* U3DLL, U3RBR and U3THR       */
																		/* share the same address       */
#define U3DLL                   (*(volatile unsigned long *)0x4009C000)                                
#define U3RBR                   (*(volatile unsigned long *)0x4009C000)
#define U3THR                   (*(volatile unsigned long *)0x4009C000)

#define U3IER                   (*(volatile unsigned long *)0x4009C004) /* U3DLM and U3IER              */
																		/* share the same address       */
#define U3DLM                   (*(volatile unsigned long *)0x4009C004)                                 
    
#define U3FCR                   (*(volatile unsigned long *)0x4009C008) /* U3FCR and U3IIR              */
																		/* share the same address       */
#define U3IIR                   (*(volatile unsigned long *)0x4009C008)                                   

#define U3LCR                   (*(volatile unsigned long *)0x4009C00C)
#define U3LSR                   (*(volatile unsigned long *)0x4009C014)
#define U3SCR                   (*(volatile unsigned long *)0x4009C01C)
#define U3ACR                   (*(volatile unsigned long *)0x4009C020)
#define U3ICR                   (*(volatile unsigned long *)0x4009C024)
#define U3FDR                   (*(volatile unsigned long *)0x4009C028)
#define U3TER                   (*(volatile unsigned long *)0x4009C030)
#define U3FIFOLVL               (*(volatile unsigned long *)0x4009C058)

/*********************************************************************************************************
**  CAN控制器
*********************************************************************************************************/
#define AFMR                    (*(volatile unsigned long *)0x4003C000)
#define SFF_SA                  (*(volatile unsigned long *)0x4003C004)
#define SFF_GRP_SA              (*(volatile unsigned long *)0x4003C008)
#define EFF_SA                  (*(volatile unsigned long *)0x4003C00C)
#define EFF_GRP_SA              (*(volatile unsigned long *)0x4003C010)
#define ENDOFTABLE              (*(volatile unsigned long *)0x4003C014)
#define LUTERRAD                (*(volatile unsigned long *)0x4003C018)
#define LUTERR                  (*(volatile unsigned long *)0x4003C01C)
#define FCANIE                  (*(volatile unsigned long *)0x4003C020)
#define FCANIC0                 (*(volatile unsigned long *)0x4003C024)
#define FCANIC1                 (*(volatile unsigned long *)0x4003C028)
#define CANTXSR                 (*(volatile unsigned long *)0x40040000)
#define CANRXSR                 (*(volatile unsigned long *)0x40040004)
#define CANMSR                  (*(volatile unsigned long *)0x40040008)
#define CAN1MOD                 (*(volatile unsigned long *)0x40044000)
#define CAN1CMR                 (*(volatile unsigned long *)0x40044004)
#define CAN1GSR                 (*(volatile unsigned long *)0x40044008)
#define CAN1ICR                 (*(volatile unsigned long *)0x4004400C)
#define CAN1IER                 (*(volatile unsigned long *)0x40044010)
#define CAN1BTR                 (*(volatile unsigned long *)0x40044014)
#define CAN1EWL                 (*(volatile unsigned long *)0x40044018)
#define CAN1SR                  (*(volatile unsigned long *)0x4004401C)
#define CAN1RFS                 (*(volatile unsigned long *)0x40044020)
#define CAN1RID                 (*(volatile unsigned long *)0x40044024)
#define CAN1RDA                 (*(volatile unsigned long *)0x40044028)
#define CAN1RDB                 (*(volatile unsigned long *)0x4004402C)
#define CAN1TFI1                (*(volatile unsigned long *)0x40044030)
#define CAN1TID1                (*(volatile unsigned long *)0x40044034)
#define CAN1TDA1                (*(volatile unsigned long *)0x40044038)
#define CAN1TDB1                (*(volatile unsigned long *)0x4004403C)
#define CAN1TFI2                (*(volatile unsigned long *)0x40044040)
#define CAN1TID2                (*(volatile unsigned long *)0x40044044)
#define CAN1TDA2                (*(volatile unsigned long *)0x40044048)
#define CAN1TDB2                (*(volatile unsigned long *)0x4004404C)
#define CAN1TFI3                (*(volatile unsigned long *)0x40044050)
#define CAN1TID3                (*(volatile unsigned long *)0x40044054)
#define CAN1TDA3                (*(volatile unsigned long *)0x40044058)
#define CAN1TDB3                (*(volatile unsigned long *)0x4004405C)
#define CAN2MOD                 (*(volatile unsigned long *)0x40048000)
#define CAN2CMR                 (*(volatile unsigned long *)0x40048004)
#define CAN2GSR                 (*(volatile unsigned long *)0x40048008)
#define CAN2ICR                 (*(volatile unsigned long *)0x4004800C)
#define CAN2IER                 (*(volatile unsigned long *)0x40048010)
#define CAN2BTR                 (*(volatile unsigned long *)0x40048014)
#define CAN2EWL                 (*(volatile unsigned long *)0x40048018)
#define CAN2SR                  (*(volatile unsigned long *)0x4004801C)
#define CAN2RFS                 (*(volatile unsigned long *)0x40048020)
#define CAN2RID                 (*(volatile unsigned long *)0x40048024)
#define CAN2RDA                 (*(volatile unsigned long *)0x40048028)
#define CAN2RDB                 (*(volatile unsigned long *)0x4004802C)
#define CAN2TFI1                (*(volatile unsigned long *)0x40048030)
#define CAN2TID1                (*(volatile unsigned long *)0x40048034)
#define CAN2TDA1                (*(volatile unsigned long *)0x40048038)
#define CAN2TDB1                (*(volatile unsigned long *)0x4004803C)
#define CAN2TFI2                (*(volatile unsigned long *)0x40048040)
#define CAN2TID2                (*(volatile unsigned long *)0x40048044)
#define CAN2TDA2                (*(volatile unsigned long *)0x40048048)
#define CAN2TDB2                (*(volatile unsigned long *)0x4004804C)
#define CAN2TFI3                (*(volatile unsigned long *)0x40048050)
#define AN2TID3                 (*(volatile unsigned long *)0x40048054)
#define CAN2TDA3                (*(volatile unsigned long *)0x40048058)
#define CAN2TDB3                (*(volatile unsigned long *)0x4004805C)

