yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  SPI
*********************************************************************************************************/
#define S0SPCR                  (*(volatile unsigned long *)0x40020000)
#define S0SPSR                  (*(volatile unsigned long *)0x40020004)
#define S0SPDR                  (*(volatile unsigned long *)0x40020008)
#define S0SPCCR                 (*(volatile unsigned long *)0x4002000C)
#define SPTCR                   (*(volatile unsigned long *)0x40020010)
#define SPTSR                   (*(volatile unsigned long *)0x40020014)
#define S0SPINT                 (*(volatile unsigned long *)0x4002001C)

/*********************************************************************************************************
**  SSP0
*********************************************************************************************************/
#define SSP0CR0                 (*(volatile unsigned long *)0x40088000)
#define SSP0CR1                 (*(volatile unsigned long *)0x40088004)
#define SSP0DR                  (*(volatile unsigned long *)0x40088008)
#define SSP0SR                  (*(volatile unsigned long *)0x4008800C)
#define SSP0CPSR                (*(volatile unsigned long *)0x40088010)
#define SSP0IMSC                (*(volatile unsigned long *)0x40088014)
#define SSP0RIS                 (*(volatile unsigned long *)0x40088018)
#define SSP0MIS                 (*(volatile unsigned long *)0x4008801C)
#define SSP0ICR                 (*(volatile unsigned long *)0x40088020)
#define SSP0DMACR               (*(volatile unsigned long *)0x40088024)

/*********************************************************************************************************
**  SSP1
*********************************************************************************************************/
#define SSP1CR0                 (*(volatile unsigned long *)0x40030000)
#define SSP1CR1                 (*(volatile unsigned long *)0x40030004)
#define SSP1DR                  (*(volatile unsigned long *)0x40030008)
#define SSP1SR                  (*(volatile unsigned long *)0x4003000C)
#define SSP1CPSR                (*(volatile unsigned long *)0x40030010)
#define SSP1IMSC                (*(volatile unsigned long *)0x40030014)
#define SSP1RIS                 (*(volatile unsigned long *)0x40030018)
#define SSP1MIS                 (*(volatile unsigned long *)0x4003001C)
#define SSP1ICR                 (*(volatile unsigned long *)0x40030020)
#define SSP1DMACR               (*(volatile unsigned long *)0x40030024)

/*********************************************************************************************************
**  I2C0
*********************************************************************************************************/
#define I2C0CONSET              (*(volatile unsigned long *)0x4001C000)
#define I2C0STAT                (*(volatile unsigned long *)0x4001C004)
#define I2C0DAT                 (*(volatile unsigned long *)0x4001C008)
#define I2C0ADR                 (*(volatile unsigned long *)0x4001C00C)
#define I2C0SCLH                (*(volatile unsigned long *)0x4001C010)
#define I2C0SCLL                (*(volatile unsigned long *)0x4001C014)
#define I2C0CONCLR              (*(volatile unsigned long *)0x4001C018)
#define I2C0MMCTRL              (*(volatile unsigned long *)0x4001C01C)
#define I2C0ADR1                (*(volatile unsigned long *)0x4001C020)
#define I2C0ADR2                (*(volatile unsigned long *)0x4001C024)
#define I2C0ADR3                (*(volatile unsigned long *)0x4001C028)
#define I2C0DATABUFFER          (*(volatile unsigned long *)0x4001C02C)
#define I2C0MASK0               (*(volatile unsigned long *)0x4001C030)
#define I2C0MASK1               (*(volatile unsigned long *)0x4001C034)
#define I2C0MASK2               (*(volatile unsigned long *)0x4001C038)
#define I2C0MASK3               (*(volatile unsigned long *)0x4001C03C)

/*********************************************************************************************************
**  I2C1
*********************************************************************************************************/
#define I2C1CONSET              (*(volatile unsigned long *)0x4005C000)
#define I2C1STAT                (*(volatile unsigned long *)0x4005C004)
#define I2C1DAT                 (*(volatile unsigned long *)0x4005C008)
#define I2C1ADR                 (*(volatile unsigned long *)0x4005C00C)
#define I2C1SCLH                (*(volatile unsigned long *)0x4005C010)
#define I2C1SCLL                (*(volatile unsigned long *)0x4005C014)
#define I2C1CONCLR              (*(volatile unsigned long *)0x4005C018)
#define I2C1MMCTRL              (*(volatile unsigned long *)0x4005C01C)
#define I2C1ADR1                (*(volatile unsigned long *)0x4005C020)
#define I2C1ADR2                (*(volatile unsigned long *)0x4005C024)
#define I2C1ADR3                (*(volatile unsigned long *)0x4005C028)
#define I2C1DATABUFFER          (*(volatile unsigned long *)0x4005C02C)
#define I2C1MASK0               (*(volatile unsigned long *)0x4005C030)
#define I2C1MASK1               (*(volatile unsigned long *)0x4005C034)
#define I2C1MASK2               (*(volatile unsigned long *)0x4005C038)
#define I2C1MASK3               (*(volatile unsigned long *)0x4005C03C)

/*********************************************************************************************************
**  I2C2
*********************************************************************************************************/
#define I2C2CONSET              (*(volatile unsigned long *)0x400A0000)
#define I2C2STAT                (*(volatile unsigned long *)0x400A0004)
#define I2C2DAT                 (*(volatile unsigned long *)0x400A0008)
#define I2C2ADR                 (*(volatile unsigned long *)0x400A000C)
#define I2C2SCLH                (*(volatile unsigned long *)0x400A0010)
#define I2C2SCLL                (*(volatile unsigned long *)0x400A0014)
#define I2C2CONCLR              (*(volatile unsigned long *)0x400A0018)
#define I2C2MMCTRL              (*(volatile unsigned long *)0x400A001C)
#define I2C2ADR1                (*(volatile unsigned long *)0x400A0020)
#define I2C2ADR2                (*(volatile unsigned long *)0x400A0024)
#define I2C2ADR3                (*(volatile unsigned long *)0x400A0028)
#define I2C2DATABUFFER          (*(volatile unsigned long *)0x400A002C)
#define I2C2MASK0               (*(volatile unsigned long *)0x400A0030)
#define I2C2MASK1               (*(volatile unsigned long *)0x400A0034)
#define I2C2MASK2               (*(volatile unsigned long *)0x400A0038)
#define I2C2MASK3               (*(volatile unsigned long *)0x400A003C)

