yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  I2S
*********************************************************************************************************/
#define I2SDAO                  (*(volatile unsigned long *)0x400A8000)
#define I2SDAI                  (*(volatile unsigned long *)0x400A8004)
#define I2STXFIFO               (*(volatile unsigned long *)0x400A8008)
#define I2SRXFIFO               (*(volatile unsigned long *)0x400A800C)
#define I2SSTATE                (*(volatile unsigned long *)0x400A8010)
#define I2SDMA1                 (*(volatile unsigned long *)0x400A8014)
#define I2SDMA2                 (*(volatile unsigned long *)0x400A8018)
#define I2SIRQ                  (*(volatile unsigned long *)0x400A801C)
#define I2STXRATE               (*(volatile unsigned long *)0x400A8020)
#define I2SRXRATE               (*(volatile unsigned long *)0x400A8024)
#define I2STXBITRATE            (*(volatile unsigned long *)0x400A8028)
#define I2SRXBITRATE            (*(volatile unsigned long *)0x400A802C)
#define I2STXMODE               (*(volatile unsigned long *)0x400A8030)
#define I2SRXMODE               (*(volatile unsigned long *)0x400A8034)

/*********************************************************************************************************
**  TIMER0
*********************************************************************************************************/
#define T0IR                    (*(volatile unsigned long *)0x40004000)
#define T0TCR                   (*(volatile unsigned long *)0x40004004)
#define T0TC                    (*(volatile unsigned long *)0x40004008)
#define T0PR                    (*(volatile unsigned long *)0x4000400C)
#define T0PC                    (*(volatile unsigned long *)0x40004010)
#define T0MCR                   (*(volatile unsigned long *)0x40004014)
#define T0MR0                   (*(volatile unsigned long *)0x40004018)
#define T0MR1                   (*(volatile unsigned long *)0x4000401C)
#define T0MR2                   (*(volatile unsigned long *)0x40004020)
#define T0MR3                   (*(volatile unsigned long *)0x40004024)
#define T0CCR                   (*(volatile unsigned long *)0x40004028)
#define T0CR0                   (*(volatile unsigned long *)0x4000402C)
#define T0CR1                   (*(volatile unsigned long *)0x40004030)
#define T0EMR                   (*(volatile unsigned long *)0x4000403C)
#define T0CTCR                  (*(volatile unsigned long *)0x40004070)

/*********************************************************************************************************
**  TIMER1
*********************************************************************************************************/
#define T1IR                    (*(volatile unsigned long *)0x40008000)
#define T1TCR                   (*(volatile unsigned long *)0x40008004)
#define T1TC                    (*(volatile unsigned long *)0x40008008)
#define T1PR                    (*(volatile unsigned long *)0x4000800C)
#define T1PC                    (*(volatile unsigned long *)0x40008010)
#define T1MCR                   (*(volatile unsigned long *)0x40008014)
#define T1MR0                   (*(volatile unsigned long *)0x40008018)
#define T1MR1                   (*(volatile unsigned long *)0x4000801C)
#define T1MR2                   (*(volatile unsigned long *)0x40008020)
#define T1MR3                   (*(volatile unsigned long *)0x40008024)
#define T1CCR                   (*(volatile unsigned long *)0x40008028)
#define T1CR0                   (*(volatile unsigned long *)0x4000802C)
#define T1CR1                   (*(volatile unsigned long *)0x40008030)
#define T1EMR                   (*(volatile unsigned long *)0x4000803C)
#define T1CTCR                  (*(volatile unsigned long *)0x40008070)

/*********************************************************************************************************
**  TIMER2
*********************************************************************************************************/
#define T2IR                    (*(volatile unsigned long *)0x40090000)
#define T2TCR                   (*(volatile unsigned long *)0x40090004)
#define T2TC                    (*(volatile unsigned long *)0x40090008)
#define T2PR                    (*(volatile unsigned long *)0x4009000C)
#define T2PC                    (*(volatile unsigned long *)0x40090010)
#define T2MCR                   (*(volatile unsigned long *)0x40090014)
#define T2MR0                   (*(volatile unsigned long *)0x40090018)
#define T2MR1                   (*(volatile unsigned long *)0x4009001C)
#define T2MR2                   (*(volatile unsigned long *)0x40090020)
#define T2MR3                   (*(volatile unsigned long *)0x40090024)
#define T2CCR                   (*(volatile unsigned long *)0x40090028)
#define T2CR0                   (*(volatile unsigned long *)0x4009002C)
#define T2CR1                   (*(volatile unsigned long *)0x40090030)
#define T2EMR                   (*(volatile unsigned long *)0x4009003C)
#define T2CTCR                  (*(volatile unsigned long *)0x40090070)

/*********************************************************************************************************
**  TIMER3
*********************************************************************************************************/
#define T3IR                    (*(volatile unsigned long *)0x40094000)
#define T3TCR                   (*(volatile unsigned long *)0x40094004)
#define T3TC                    (*(volatile unsigned long *)0x40094008)
#define T3PR                    (*(volatile unsigned long *)0x4009400C)
#define T3PC                    (*(volatile unsigned long *)0x40094010)
#define T3MCR                   (*(volatile unsigned long *)0x40094014)
#define T3MR0                   (*(volatile unsigned long *)0x40094018)
#define T3MR1                   (*(volatile unsigned long *)0x4009401C)
#define T3MR2                   (*(volatile unsigned long *)0x40094020)
#define T3MR3                   (*(volatile unsigned long *)0x40094024)
#define T3CCR                   (*(volatile unsigned long *)0x40094028)
#define T3CR0                   (*(volatile unsigned long *)0x4009402C)
#define T3CR1                   (*(volatile unsigned long *)0x40094030)
#define T3EMR                   (*(volatile unsigned long *)0x4009403C)
#define T3CTCR                  (*(volatile unsigned long *)0x40094070)
                        
