yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  Repetitive Interrupt Timer 可重复性中断控制器
*********************************************************************************************************/
#define RICOMPVAL               (*(volatile unsigned long *)0x400B0000)
#define RIMASK                  (*(volatile unsigned long *)0x400B0004)
#define RICTRL                  (*(volatile unsigned long *)0x400B0008)
#define RICOUNTER               (*(volatile unsigned long *)0x400B000C)
                         
/*********************************************************************************************************
**  PWM1
*********************************************************************************************************/
#define PWM1IR                  (*(volatile unsigned long *)0x40018000)
#define PWM1TCR                 (*(volatile unsigned long *)0x40018004)
#define PWM1TC                  (*(volatile unsigned long *)0x40018008)
#define PWM1PR                  (*(volatile unsigned long *)0x4001800C)
#define PWM1PC                  (*(volatile unsigned long *)0x40018010)
#define PWM1MCR                 (*(volatile unsigned long *)0x40018014)
#define PWM1MR0                 (*(volatile unsigned long *)0x40018018)
#define PWM1MR1                 (*(volatile unsigned long *)0x4001801C)
#define PWM1MR2                 (*(volatile unsigned long *)0x40018020)
#define PWM1MR3                 (*(volatile unsigned long *)0x40018024)
#define PWM1CCR                 (*(volatile unsigned long *)0x40018028)
#define PWM1CR0                 (*(volatile unsigned long *)0x4001802C)
#define PWM1CR1                 (*(volatile unsigned long *)0x40018030)
#define PWM1MR4                 (*(volatile unsigned long *)0x40018040)
#define PWM1MR5                 (*(volatile unsigned long *)0x40018044)
#define PWM1MR6                 (*(volatile unsigned long *)0x40018048)
#define PWM1PCR                 (*(volatile unsigned long *)0x4001804C)
#define PWM1LER                 (*(volatile unsigned long *)0x40018050)
#define PWM1CTCR                (*(volatile unsigned long *)0x40018070)

/*********************************************************************************************************
**  Motor control PWM
*********************************************************************************************************/
#define MCCON                   (*(volatile unsigned long *)0x400B8000)
#define MCCON_SET               (*(volatile unsigned long *)0x400B8004)
#define MCCON_CLR               (*(volatile unsigned long *)0x400B8008)
#define MCCAPCON                (*(volatile unsigned long *)0x400B800C)
#define MCCAPCON_SET            (*(volatile unsigned long *)0x400B8010)
#define MCCAPCON_CLR            (*(volatile unsigned long *)0x400B8014)
#define MCTC0                   (*(volatile unsigned long *)0x400B8018)
#define MCTC1                   (*(volatile unsigned long *)0x400B801C)
#define MCTC2                   (*(volatile unsigned long *)0x400B8020)
#define MCLIM0                  (*(volatile unsigned long *)0x400B8024)
#define MCLIM1                  (*(volatile unsigned long *)0x400B8028)
#define MCLIM2                  (*(volatile unsigned long *)0x400B802C)
#define MCMAT0                  (*(volatile unsigned long *)0x400B8030)
#define MCMAT1                  (*(volatile unsigned long *)0x400B8034)
#define MCMAT2                  (*(volatile unsigned long *)0x400B8038)
#define MCDT                    (*(volatile unsigned long *)0x400B803C)
#define MCCP                    (*(volatile unsigned long *)0x400B8040)
#define MCCR0                   (*(volatile unsigned long *)0x400B8044)
#define MCCR1                   (*(volatile unsigned long *)0x400B8048)
#define CCR2                    (*(volatile unsigned long *)0x400B804C)
#define MCINTEN                 (*(volatile unsigned long *)0x400B8050)
#define MCINTEN_SET             (*(volatile unsigned long *)0x400B8054)
#define MCINTEN_CLR             (*(volatile unsigned long *)0x400B8058)
#define MCCNTCON                (*(volatile unsigned long *)0x400B805C)
#define MCCNTCON_SET            (*(volatile unsigned long *)0x400B8060)
#define MCCNTCON_CLR            (*(volatile unsigned long *)0x400B8064)
#define MCINTFLAG               (*(volatile unsigned long *)0x400B8068)
#define MCINTFLAG_SET           (*(volatile unsigned long *)0x400B806C)
#define MCINTFLAG_CLR           (*(volatile unsigned long *)0x400B8070)
#define MCCAP_CLR               (*(volatile unsigned long *)0x400B8074)

/*********************************************************************************************************
**  Quadrature Encoder Interface
*********************************************************************************************************/
#define QEICON                  (*(volatile unsigned long *)0x400BC000)
#define QEISTAT                 (*(volatile unsigned long *)0x400BC004)
#define QEICONF                 (*(volatile unsigned long *)0x400BC008)
#define QEIPOS                  (*(volatile unsigned long *)0x400BC00C)
#define QEIMAXPSOS              (*(volatile unsigned long *)0x400BC010)
#define CMPOS0                  (*(volatile unsigned long *)0x400BC014)
#define CMPOS1                  (*(volatile unsigned long *)0x400BC018)
#define CMPOS2                  (*(volatile unsigned long *)0x400BC01C)
#define INXCNT                  (*(volatile unsigned long *)0x400BC020)
#define INXCMP                  (*(volatile unsigned long *)0x400BC024)
#define QEILOAD                 (*(volatile unsigned long *)0x400BC028)
#define QEITIME                 (*(volatile unsigned long *)0x400BC02C)
#define QEIVEL                  (*(volatile unsigned long *)0x400BC030)
#define QEICAP                  (*(volatile unsigned long *)0x400BC034)
#define VELCOMP                 (*(volatile unsigned long *)0x400BC038)
#define FILTER                  (*(volatile unsigned long *)0x400BC03C)
#define QEIIES                  (*(volatile unsigned long *)0x400BCFDC)
#define QEIIEC                  (*(volatile unsigned long *)0x400BCFD8)
#define QEIINTSTAT              (*(volatile unsigned long *)0x400BCFE0)
#define QEIIE                   (*(volatile unsigned long *)0x400BCFE4)
#define QEICLR                  (*(volatile unsigned long *)0x400BCFE8)
#define QEISET                  (*(volatile unsigned long *)0x400BCFEC)

