yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  RTC
*********************************************************************************************************/
#define RTCILR                  (*(volatile unsigned long *)0x40024000)
#define RTCCCR                  (*(volatile unsigned long *)0x40024008)
#define RTCCIIR                 (*(volatile unsigned long *)0x4002400C)
#define RTCAMR                  (*(volatile unsigned long *)0x40024010)
#define RTCCTIME0               (*(volatile unsigned long *)0x40024014)
#define RTCCTIME1               (*(volatile unsigned long *)0x40024018)
#define RTCCTIME2               (*(volatile unsigned long *)0x4002401C)
#define RTCSEC                  (*(volatile unsigned long *)0x40024020)
#define RTCMIN                  (*(volatile unsigned long *)0x40024024)
#define RTCHOUR                 (*(volatile unsigned long *)0x40024028)
#define RTCDOM                  (*(volatile unsigned long *)0x4002402C)
#define RTCDOW                  (*(volatile unsigned long *)0x40024030)
#define RTCDOY                  (*(volatile unsigned long *)0x40024034)
#define RTCMONTH                (*(volatile unsigned long *)0x40024038)
#define RTCYEAR                 (*(volatile unsigned long *)0x4002403C)
#define RTCCALIBRATION          (*(volatile unsigned long *)0x40024040)
#define RTCGPREG0               (*(volatile unsigned long *)0x40024044)
#define RTCGPREG1               (*(volatile unsigned long *)0x40024048)
#define RTCGPREG2               (*(volatile unsigned long *)0x4002404C)
#define RTCGPREG3               (*(volatile unsigned long *)0x40024050)
#define RTCGPREG4               (*(volatile unsigned long *)0x40024054)
#define RTCALSEC                (*(volatile unsigned long *)0x40024060)
#define RTCALMIN                (*(volatile unsigned long *)0x40024064)
#define RTCALHOUR               (*(volatile unsigned long *)0x40024068)
#define RTCALDOM                (*(volatile unsigned long *)0x4002406C)
#define RTCALDOW                (*(volatile unsigned long *)0x40024070)
#define RTCALDOY                (*(volatile unsigned long *)0x40024074)
#define RTCALMON                (*(volatile unsigned long *)0x40024078)
#define RTCALYEAR               (*(volatile unsigned long *)0x4002407C)
#define RTC_AUX                 (*(volatile unsigned long *)0x4002405c)
#define RTC_AUXEN               (*(volatile unsigned long *)0x40024058)

/*********************************************************************************************************
**  Watchdog
*********************************************************************************************************/
//#define WDMOD                   (*(volatile unsigned long *)0x40000000)
//#define WDTC                    (*(volatile unsigned long *)0x40000004)
//#define WDFEED                  (*(volatile unsigned long *)0x40000008)
//#define WDTV                    (*(volatile unsigned long *)0x4000000C)
//#define WDCLKSEL                (*(volatile unsigned long *)0x40000010)

/*********************************************************************************************************
**  A/D Converters
*********************************************************************************************************/
#define AD0CR                   (*(volatile unsigned long *)0x40034000)
#define AD0GDR                  (*(volatile unsigned long *)0x40034004)
#define ADINTEN                 (*(volatile unsigned long *)0x4003400C)
#define ADDR0                   (*(volatile unsigned long *)0x40034010)
#define ADDR1                   (*(volatile unsigned long *)0x40034014)
#define ADDR2                   (*(volatile unsigned long *)0x40034018)
#define ADDR3                   (*(volatile unsigned long *)0x4003401C)
#define ADDR4                   (*(volatile unsigned long *)0x40034020)
#define ADDR5                   (*(volatile unsigned long *)0x40034024)
#define ADDR6                   (*(volatile unsigned long *)0x40034028)
#define ADDR7                   (*(volatile unsigned long *)0x4003402C)
#define ADSTAT                  (*(volatile unsigned long *)0x40034030)
#define ADTRM                   (*(volatile unsigned long *)0x40034034)

/*********************************************************************************************************
**  D/A Converter
*********************************************************************************************************/
#define DA0CR                    (*(volatile unsigned long *)0x4008C000)
#define DACCTRL                 (*(volatile unsigned long *)0x4008C004)
#define DACCNTVAL               (*(volatile unsigned long *)0x4008C008)

/*********************************************************************************************************
**  GPDMA
*********************************************************************************************************/
#define DMACIntStat             (*(volatile unsigned long *)0x50004000)
#define DMACIntTCStat           (*(volatile unsigned long *)0x50004004)
#define DMACIntTCClear          (*(volatile unsigned long *)0x50004008)
#define DMACIntErrStat          (*(volatile unsigned long *)0x5000400C)
#define DMACIntErrClr           (*(volatile unsigned long *)0x50004010)
#define DMACRawIntTCStat        (*(volatile unsigned long *)0x50004014)
#define DMACRawIntErrStat       (*(volatile unsigned long *)0x50004018)
#define DMACEnbldChns           (*(volatile unsigned long *)0x5000401C)
#define DMACSoftBReq            (*(volatile unsigned long *)0x50004020)
#define DMACSoftSReq            (*(volatile unsigned long *)0x50004024)
#define DMACSoftLBReq           (*(volatile unsigned long *)0x50004028)
#define DMACSoftLSReq           (*(volatile unsigned long *)0x5000402C)
#define DMACConfig              (*(volatile unsigned long *)0x50004030)
#define DMACSync                (*(volatile unsigned long *)0x50004034)
#define DMACC0SrcAddr           (*(volatile unsigned long *)0x50004100)
#define DMACC0DestAddr          (*(volatile unsigned long *)0x50004104)
#define DMACC0LLI               (*(volatile unsigned long *)0x50004108)
#define DMACC0Control           (*(volatile unsigned long *)0x5000410C)
#define DMACC0Config            (*(volatile unsigned long *)0x50004110)
#define DMACC1SrcAddr           (*(volatile unsigned long *)0x50004120)
#define DMACC1DestAddr          (*(volatile unsigned long *)0x50004124)
#define DMACC1LLI               (*(volatile unsigned long *)0x50004128)
#define DMACC1Control           (*(volatile unsigned long *)0x5000412C)
#define DMACC1Config            (*(volatile unsigned long *)0x50004130)
#define DMACC2SrcAddr           (*(volatile unsigned long *)0x50004140)
#define DMACC2DestAddr          (*(volatile unsigned long *)0x50004144)
#define DMACC2LLI               (*(volatile unsigned long *)0x50004148)
#define DMACC2Control           (*(volatile unsigned long *)0x5000414C)
#define DMACC2Config            (*(volatile unsigned long *)0x50004150)
#define DMACC3SrcAddr           (*(volatile unsigned long *)0x50004160)
#define DMACC3DestAddr          (*(volatile unsigned long *)0x50004164)
#define MACC3LLI                (*(volatile unsigned long *)0x50004168)
#define DMACC3Control           (*(volatile unsigned long *)0x5000416C)
#define DMACC3Config            (*(volatile unsigned long *)0x50004170)
#define DMACC4SrcAddr           (*(volatile unsigned long *)0x50004180)
#define DMACC4DestAddr          (*(volatile unsigned long *)0x50004184)
#define DMACC4LLI               (*(volatile unsigned long *)0x50004188)
#define DMACC4Control           (*(volatile unsigned long *)0x5000418C)
#define DMACC4Config            (*(volatile unsigned long *)0x50004190)
#define DMACC5SrcAddr           (*(volatile unsigned long *)0x500041A0)
#define MACC5DestAddr           (*(volatile unsigned long *)0x500041A4)
#define DMACC5LLI               (*(volatile unsigned long *)0x500041A8)
#define DMACC5Control           (*(volatile unsigned long *)0x500041AC)
#define DMACC5Config            (*(volatile unsigned long *)0x500041B0)
#define DMACC6SrcAddr           (*(volatile unsigned long *)0x500041C0)
#define DMACC6DestAddr          (*(volatile unsigned long *)0x500041C4)
#define DMACC6LLI               (*(volatile unsigned long *)0x500041C8)
#define DMACC6Control           (*(volatile unsigned long *)0x500041CC)
#define DMACC6Config            (*(volatile unsigned long *)0x500041D0)
#define DMACC7SrcAddr           (*(volatile unsigned long *)0x500041E0)
#define DMACC7DestAddr          (*(volatile unsigned long *)0x500041E4)
#define DMACC7LLI               (*(volatile unsigned long *)0x500041E8)
#define DMACC7Control           (*(volatile unsigned long *)0x500041EC)
#define DMACC7Config            (*(volatile unsigned long *)0x500041F0)

