yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  GPDMA Controller peripheral devices lines GPDMA 外围设备控制通道号
*********************************************************************************************************/
#define GPDMA_SSP0TX            0                                       /* SPI0 Tx                      */
#define GPDMA_SSP0RX            1                                       /* SPI0 Rx                      */
#define GPDMA_SSP1TX            2                                       /* SPI1 Tx                      */
#define GPDMA_SSP1RX            3                                       /* SPI1 Rx                      */
#define GPDMA_ADC               4                                       /* ADC                          */
#define GPDMA_I2S0              5                                       /* I2S Channel 0                */
#define GPDMA_I2S1              6                                       /* I2S Channel 1                */
#define GPDMA_DAC               7                                       /* ADC                          */
#define GPDMA_U0TX_MAT0_0       8                                       /* UART 0 Tx/MAT0.0             */
#define GPDMA_U0RX_MAT0_1       9                                       /* UART 0 Rx/MAT0.1             */
#define GPDMA_U1TX_MAT1_0      10                                       /* UART 1 Tx/MAT1.0             */
#define GPDMA_U1RX_MAT1_1      11                                       /* UART 1 Rx/MAT1.1             */
#define GPDMA_U2TX_MAT2_0      12                                       /* UART 2 Tx/MAT2.0             */
#define GPDMA_U2RX_MAT2_1      13                                       /* UART 2 Rx/MAT2.1             */
#define GPDMA_U3TX_MAT3_0      14                                       /* UART 3 Tx/MAT3.0             */
#define GPDMA_U3RX_MAT3_1      15                                       /* UART 3 Rx/MAT3.1             */

/*********************************************************************************************************
**  NVIC Interrupt channels  NVIC中断控制通道号
*********************************************************************************************************/
#define MAIN_STACK             0                                        /* Main Stack                   */
#define RESETI                 1                                        /* Reset                                                  */
#define NMII                   2                                        /* Non-maskable Interrupt       */
#define HFI                    3                                        /* Hard Fault                                             */
#define MMI                    4                                        /* Memory Management            */
#define BFI                    5                                        /* Bus Fault                                              */
#define UFI                    6                                        /* Usage Fault                  */
#define SVCI                  11                                        /* SVCall                       */
#define DMI                   12                                        /* Debug Monitor                */
#define PSI                   14                                        /* PendSV                       */
#define STI                   15                                        /* SysTick                      */
#define NVIC_WDT              16                                        /* Watchdog Interrupt (WDINT)   */
#define NVIC_TIMER0           17                                        /* Match 0-1(MR0, MR1),         */
                                                                        /* Capture 0-1(CR0, CR1)        */
#define NVIC_TIMER1           18                                        /* Match 0 - 2 (MR0, MR1, MR2), */
                                                                        /* Capture 0 - 1 (CR0, CR1)     */
#define NVIC_TIMER2           19                                        /* Match 0-3, Capture 0-1       */
#define NVIC_TIMER3           20                                        /* Match 0-3, Capture 0-1       */
#define NVIC_UART0            21                                        /* UART0                        */
#define NVIC_UART1            22                                        /* UART1                        */
#define NVIC_UART2            23                                        /* UART2                        */
#define NVIC_UART3            24                                        /* UART3                        */
#define NVIC_PWM1             25                                        /* Match 0 - 6 of PWM1,         */
                                                                        /* Capture 0-1 of PWM1          */
#define NVIC_I2C0             26                                        /* SI (state change)            */
#define NVIC_I2C1             27                                        /* SI (state change)            */
#define NVIC_I2C2             28                                        /* SI (state change)            */
#define NVIC_SPI              29                                        /* SPI Interrupt Flag (SPIF),   */
                                                                        /* Mode Fault (MODF)            */
#define NVIC_SSP0             30                                        /* SSP0                         */
#define NVIC_SSP1             31                                        /* SSP1                         */
#define NVIC_PLL0             32                                        /* PLL0 Lock                    */
#define NVIC_RTC              33                                        /* Counter Increment (RTCCIF),  */
                                                                        /* Alarm (RTCALF)               */
#define NVIC_EINT0            34                                        /* External Interrupt 0 (EINT0) */
#define NVIC_EINT1            35                                        /* External Interrupt 1 (EINT1) */
#define NVIC_EINT2            36                                        /* External Interrupt 2 (EINT2) */
#define NVIC_EINT3            37                                        /* External Interrupt 3 (EINT3) */
#define NVIC_ADC              38                                        /* A/D Converter                */
#define NVIC_BOD              39                                        /* Brown Out detect             */
#define NVIC_USB              40                                        /* USB                          */
#define NVIC_CAN              41                                        /* CAN Common, CAN 0 Tx,        */
                                                                        /* CAN 0 Rx, CAN 1 Tx, CAN 1 Rx */
#define NVIC_GP_DMA           42                                        /* IntStatus of DMA channel 0,  */
                                                                        /* IntStatus of DMA channel 1   */
#define NVIC_I2S              43                                        /* irq, dmareq1, dmareq2        */
#define NVIC_ETHR             44                                        /* Ethernet                     */
#define NVIC_RIT              45                                        /* Repetitive Interrupt Timer   */
#define NVIC_MC               46                                        /* Motor Control PWM            */
#define NVIC_QE               47                                        /* Quadrature Encoder           */
#define NVIC_PLL1             48                                        /* PLL1 Lock                    */

