yinyuntong/ETZX-V1.3/ETZX-V1.3/GLZJ-LPC/20190110/source/lpc1700_reg.h
/*********************************************************************************************************
**  NVIC Interrupt Priority   NVIC中断优先级
*********************************************************************************************************/
#define PRIO_ZERO            (0x00)                                     /* 优先级为0                    */
#define PRIO_ONE             (0x01 << 3)                                /* 优先级为1                    */
#define PRIO_TWO             (0x02 << 3)                                /* 优先级为2                    */
#define PRIO_THREE           (0x03 << 3)                                /* 优先级为3                    */
#define PRIO_FOUR            (0x04 << 3)                                /* 优先级为4                    */
#define PRIO_FIVE            (0x05 << 3)                                /* 优先级为5                    */
#define PRIO_SIX             (0x06 << 3)                                /* 优先级为6                    */
#define PRIO_SEVEN           (0x07 << 3)                                /* 优先级为7                    */
#define PRIO_EIGHT           (0x08 << 3)                                /* 优先级为8                    */
#define PRIO_NINE            (0x09 << 3)                                /* 优先级为9                    */
#define PRIO_TEN             (0x0A << 3)                                /* 优先级为11                   */
#define PRIO_ELEVEN          (0x0B << 3)                                /* 优先级为11                   */
#define PRIO_TWELVE    	     (0x0C << 3)                                /* 优先级为12                   */
#define PRIO_THIRTEEN   	 (0x0D << 3)                                /* 优先级为13                   */
#define PRIO_FOURTEEN   	 (0x0E << 3)                                /* 优先级为14                   */
#define PRIO_FIFTEEN       	 (0x0F << 3)                                /* 优先级为15                   */
#define PRIO_SIXTEEN         (0x10 << 3)                                /* 优先级为16                   */
#define PRIO_SEVENTEEN  	 (0x11 << 3)                                /* 优先级为17                   */
#define PRIO_EIGHTEEN   	 (0x12 << 3)                                /* 优先级为18                   */
#define PRIO_NINETEEN    	 (0x13 << 3)                                /* 优先级为19                   */
#define PRIO_TWENTY      	 (0x14 << 3)                                /* 优先级为20                   */
#define PRIO_TWENTY_ONE  	 (0x15 << 3)                                /* 优先级为21                   */
#define PRIO_TWENTY_TWO   	 (0x16 << 3)                                /* 优先级为22                   */
#define PRIO_TWENTY_THREE    (0x17 << 3)                                /* 优先级为23                   */
#define PRIO_TWENTY_FOUR     (0x18 << 3)                                /* 优先级为24                   */
#define PRIO_TWENTY_FIVE     (0x19 << 3)                                /* 优先级为25                   */
#define PRIO_TWENTY_SIX      (0x1A << 3)                                /* 优先级为26                   */
#define PRIO_TWENTY_SEVEV    (0x1B << 3)                                /* 优先级为27                   */
#define PRIO_TWENTY_EIGHT    (0x1C << 3)                                /* 优先级为28                   */
#define PRIO_TWENTY_NINE     (0x1D << 3)                                /* 优先级为29                   */
#define PRIO_THIRTY          (0x1E << 3)                                /* 优先级为30                   */
#define PRIO_THIRTY_ONE      (0x1F << 3)                                /* 优先级为31                   */

#endif                                                                  /* __IOLPC1700_H                */
/*********************************************************************************************************
**  End Of File
*********************************************************************************************************/

